kezhangdashu/stm32repo/hal_driver/us和ms延时/DELAY/delay.c
#include "stm32f1xx.h"
#include "main.h"
#include "delay.h"


static u32  fac_us=0;							//us延时倍乘数			   
static u32  fac_ms=0;							//ms延时倍乘数,在ucos下,代表每个节拍的ms数

//SYSTICK中断回调函数
//void HAL_SYSTICK_Callback(void)
//{

//}

//void HAL_Delay(__IO uint32_t Delay)
//{
//  delay_ms(Delay);
//}
			   
//初始化延迟函数
//当使用OS的时候,此函数会初始化OS的时钟节拍
//SYSTICK的时钟固定为HCLK时钟的1/8
//SYSCLK:系统时钟
//关闭HAL库配置的SYSCLK
//注意：该函数一定要放在SystemClock_Config()后调用
void delay_init()
{
	SysTick->CTRL&=~SysTick_CTRL_TICKINT_Msk;	//关闭systick异常
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->LOAD= 0; 					        //时间加载	
	SysTick->VAL=0x00;        					//清空计数器
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK_DIV8);         //重新配置systick为HCLK八分频
	fac_us = HAL_RCC_GetHCLKFreq()/8000000;		//为系统时钟的1/8  
	fac_ms = fac_us*1000;					//非OS下,代表每个ms需要的systick时钟数  	
}								    


//延时nus
//nus为要延时的us数.		    								   
void delay_us(u32 nus)
{		
	u32 temp;	    	
	
	SysTick->LOAD=nus*fac_us; 					//时间加载	  		 
	SysTick->VAL=0x00;        					//清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;	//开始倒数	  
	do
	{
		temp=SysTick->CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0X00;      					 //清空计数器	 
}
//延时nms
//注意nms的范围
//SysTick->LOAD为24位寄存器,所以,最大延时为:
//nms<=0xffffff*8*1000/SYSCLK
//SYSCLK单位为Hz,nms单位为ms
//对72M条件下,nms<=1864 
void delay_ms(u16 nms)
{	 		  	  
	u32 temp;		   
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->LOAD=(u32)nms*fac_ms;				//时间加载(SysTick->LOAD为24bit)
	SysTick->VAL =0x00;							//清空计数器
	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;	//开始倒数  
	do
	{
		temp=SysTick->CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0X00;       					//清空计数器	  	    
} 


